emacs.org
*** rbon-goto-functions
  #+begin_src emacs-lisp :tangle ~/.emacs.d/functions.el
(defun rbon-goto-functions ()
  "Open emacs.org and narrow to keybinds."
  (interactive)
  (find-file "~/.emacs.d/emacs.org")
  (widen)
  (evil-goto-first-line)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-narrow-to-subtree)
  (org-cycle))
  #+end_src
*** rbon-goto-misc
  #+begin_src emacs-lisp :tangle ~/.emacs.d/functions.el
(defun rbon-goto-misc ()
  "Open emacs.org and narrow to keybinds."
  (interactive)
  (find-file "~/.emacs.d/emacs.org")
  (widen)
  (evil-goto-first-line)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-narrow-to-subtree)
  (org-cycle))
  #+end_src
*** rbon-goto-packages
  #+begin_src emacs-lisp :tangle ~/.emacs.d/functions.el
(defun rbon-goto-packages ()
  "Open emacs.org and narrow to keybinds."
  (interactive)
  (find-file "~/.emacs.d/emacs.org")
  (widen)
  (evil-goto-first-line)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-narrow-to-subtree)
  (org-cycle))

  #+end_src
*** rbon-goto-init
    #+begin_src emacs-lisp :tangle ~/.emacs.d/functions.el
(defun rbon-goto-init ()
  "Open emacs.org and narrow to keybinds."
  (interactive)
  (find-file "~/.emacs.d/emacs.org")
  (widen)
  (evil-goto-first-line)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-next-visible-heading 1)
  (evil-close-fold)
  (org-narrow-to-subtree)
  (org-cycle))
    #+end_src
** helm-M-x-read-extended-command 
   By default, =helm-M-x-read-extended-command= doesn't let you change the prompt. It's just hardcoded into the function. So I blatantly copy/pasted it here, with one whole line changed to allow the prompt to be a user variable. Maybe one day when I know how, I'll submit a pull request.

   It probably has something to do with the way packages are ordered, but this needs to be wrapped in an =with-eval-after-load= in order to be properly loaded.
   #+begin_src emacs-lisp :tangle ~/.emacs.d/functions.el
(with-eval-after-load 'helm-command
  (defun helm-M-x-read-extended-command (collection &optional predicate history)
    "Read or execute action on command name in COLLECTION or HISTORY.

This function has been copied verbatim from its original location and now lives
in `~/.emacs.d/functions.el', with one line changed to allow user to change the
prompt from \"M-x\" to something else.
Customize `helm-M-x-prompt-string' to change the prompt.

When `helm-M-x-use-completion-styles' is used, several actions as
of `helm-type-command' are used and executed from here, otherwise
this function returns the command as a symbol.

Helm completion is not provided when executing or defining kbd
macros.

Arg COLLECTION should be an `obarray' but can be any object
suitable for `try-completion'.  Arg PREDICATE is a function that
default to `commandp' see also `try-completion'.  Arg HISTORY
default to `extended-command-history'."
    (let* ((helm--mode-line-display-prefarg t)
          (minibuffer-completion-confirm t)
          (pred (or predicate #'commandp))
          (metadata (unless (assq 'flex completion-styles-alist)
                      '(metadata (display-sort-function
                                  .
                                  (lambda (candidates)
                                    (sort candidates #'helm-generic-sort-fn))))))
          (sources `(,(helm-make-source "Emacs Commands history" 'helm-M-x-class
                        :candidates (helm-dynamic-completion
                                      ;; A list of strings.
                                      (or history extended-command-history)
                                      (lambda (str) (funcall pred (intern-soft str)))
                                      nil 'nosort t))
                      ,(helm-make-source "Emacs Commands" 'helm-M-x-class
                        :candidates (helm-dynamic-completion
                                      collection pred
                                      nil metadata t))))
          (prompt (concat (cond
                            ((eq helm-M-x-prefix-argument '-) "- ")
                            ((and (consp helm-M-x-prefix-argument)
                                  (eq (car helm-M-x-prefix-argument) 4)) "C-u ")
                            ((and (consp helm-M-x-prefix-argument)
                                  (integerp (car helm-M-x-prefix-argument)))
                            (format "%d " (car helm-M-x-prefix-argument)))
                            ((integerp helm-M-x-prefix-argument)
                            (format "%d " helm-M-x-prefix-argument)))
                          helm-M-x-prompt-string))) ; this is the line I modified
      (setq helm-M-x--timer (run-at-time 1 0.1 'helm-M-x--notify-prefix-arg))
      ;; Fix Bug#2250, add `helm-move-selection-after-hook' which
      ;; reset prefix arg to nil only for this helm session.
      (add-hook 'helm-move-selection-after-hook
                'helm-M-x--move-selection-after-hook)
      (add-hook 'helm-before-action-hook
                'helm-M-x--before-action-hook)
      (when (and sources helm-M-x-reverse-history)
        (setq sources (nreverse sources)))
      (unwind-protect
          (progn
            (setq current-prefix-arg nil)
            (helm :sources sources
                  :prompt prompt
                  :buffer "*helm M-x*"
                  :history 'helm-M-x-input-history))
        (helm-M-x--unwind-forms)))))
   #+end_src
** rbon-switch-to-scratch
   #+begin_src emacs-lisp :tangle ~/.emacs.d/functions.el
(defun rbon-switch-to-scratch ()
  "This probably doesn't work right now."
  (interactive)
  (display-buffer-pop-up-frame (get-buffer-create "scratch")))
   #+end_src
** Haskell Mode
   These are functions that I map to =i= and =^= to make them work like you'd expect them to, while using the haskell prompt.
*** rbon-insert-haskell-prompt-start
   #+begin_src emacs-lisp :tangle ~/.emacs.d/functions.el
(defun rbon-insert-haskell-prompt-start ()
  "Enter the insert state at the start of the haskell prompt."
  (interactive)
  (goto-char haskell-interactive-mode-prompt-start)
  (call-interactively 'evil-insert))
   #+end_src
*** rbon-goto-haskell-prompt-start
    #+begin_src emacs-lisp :tangle ~/.emacs.d/functions.el
(defun rbon-goto-haskell-prompt-start ()
  "Go to the start of the haskell prompt."
  (interactive)
  (goto-char haskell-interactive-mode-prompt-start))
    #+end_src
