functions.el
(defun rbon-switch-to-scratch ()
  (interactive)
  (display-buffer-pop-up-frame (goet-buffer-create "scratch")))

(defun rbon-insert-haskell-prompt-start ()
  (interactive)
  (goto-char haskell-interactive-mode-prompt-start)
  (call-interactively 'evil-insert))

(defun rbon-goto-haskell-prompt-start ()
  (interactive)
  (goto-char haskell-interactive-mode-prompt-start))
