emacs.org
* Packages
  #+begin_src emacs-lisp :tangle ~/.emacs.d/packages.el

(setq my-packages '(
  evil
  evil-textobj-line
  toc-org
  undo-tree
  flycheck
  which-key
  ; general
  ;smooth-scrolling-mode
  helm
  helm-descbinds
  markdown-mode
  haskell-mode
  hasklig-mode
  lsp-mode
  ; lsp-ui
  lsp-haskell
  lua-mode
  solarized-theme
  exec-path-from-shell ; fix path on macos
  smex ; better than M-x
  magit
  eyebrowse ; because tab-bar-mode doesn't work on mac
  ;powerline
  mini-modeline ; put the modeline in the minibuffer added benefit of only having one modeline
  ; multiple-cursors
  evil-mc ; multiple cursors
  evil-surround
  autothemer
  doom-themes
  spacegray-theme
 ))

(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))
(package-initialize)

(defun sync-package (pac)
  (unless (package-installed-p pac)
    (package-install pac)))

(defun sync-all-packages ()
  (interactive)
  (package-refresh-contents)
  (mapcar 'sync-package my-packages))

(defun set-custom-file-path (path)
  (unless (file-exists-p path)
    (write-region "" nil path))
  (setq custom-file path)
  (load custom-file))
  #+end_src

* Init
  #+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(defun load-user-file (filename)
  "Load a file in current user's configuration directory"
  (interactive "f")
  (unless (file-exists-p (expand-file-name filename user-emacs-directory))
    (write-region "" nil filename))
  (load-file (expand-file-name filename user-emacs-directory)))  

(defun bootstrap ()
  "Run this command on a fresh install to pull down packages and load user configs."
  (interactive)
  (load-user-file "packages.el")
  (sync-all-packages)
  (load-user-file "functions.el")
  (load-user-file "misc.el")
  (org-babel-tangle-file "~/.emacs.d/keybinds.org")
  (load-user-file "keybinds.el"))

(defun rbon-load-config ()
  (interactive)
  (load-user-file "packages.el")
  (load-user-file "functions.el")
  (load-user-file "misc.el")
  (load-user-file "keybinds.el"))

(if (file-directory-p (expand-file-name "elpa" user-emacs-directory))
    (rbon-load-config))
(put 'narrow-to-region 'disabled nil)

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages
   '(mini-modeline eyebrowse magit smex exec-path-from-shell solarized-theme lua-mode lsp-haskell lsp-mode hasklig-mode haskell-mode markdown-mode which-key flycheck undo-tree evil)))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
  #+end_src

